<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"2a8c3488b7e7dffe9edff5b4c4fd050e2b2bab7db37da205cc6f81a299c08814","plan_job_ref":"Job CICD for Splitrr Infra #71 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10699041748","plan_out_hash":"0fe00cb3552535c329f2994e06811045ae4798abffb127379624b052ec3db6de","plan_hash":"55e651cc372ae0de3c63c9839622cbce08b0b2cdd8a470b5d4f3de83acaaa2c9","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 39 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.alb_acm.aws_acm_certificate_validation.acm_certificate_validation must be replaced
+/- resource "aws_acm_certificate_validation" "acm_certificate_validation" {
!~      id                      = "*********************************" -> (known after apply)
!~      validation_record_fqdns = [ # forces replacement
-           "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech",
-           "_644c24a934c0c97acebf5828bd9c671d.api.dev.bibek65.tech",
        ] -> (known after apply) # forces replacement
#        (1 unchanged attribute hidden)
    }

  # module.alb_acm.aws_route53_record.route53_record["api.dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "_644c24a934c0c97acebf5828bd9c671d.api.dev.bibek65.tech"
+       records         = [
+           "_3fe0d2ad07dcba2e03cd1f7ecbcd8c9c.djqtsrsxkq.acm-validations.aws.",
        ]
+       ttl             = 60
+       type            = "CNAME"
+       zone_id         = "*********************"
    }

  # module.alb_acm.aws_route53_record.route53_record["dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech"
+       records         = [
+           "_74072d5ad85d16f715a121df19ecc774.djqtsrsxkq.acm-validations.aws.",
        ]
+       ttl             = 60
+       type            = "CNAME"
+       zone_id         = "*********************"
    }

  # module.app_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "app"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.backend_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "api"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = "splitrr-dev-alb-1132133672.us-east-1.elb.amazonaws.com"
+           zone_id                = "**************"
        }
    }

  # module.cloudfront.data.aws_iam_policy_document.origin will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "origin" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::spiltrr-dev-bucket/*",
            ]
+           sid       = "1"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   (known after apply),
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.cloudfront.aws_cloudfront_distribution.s3_distribution will be created
+   resource "aws_cloudfront_distribution" "s3_distribution" {
+       aliases                         = [
+           "app.dev.bibek65.tech",
        ]
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       continuous_deployment_policy_id = (known after apply)
+       default_root_object             = "index.html"
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = false
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_100"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = {
+           "Name" = "Cloud Front"
        }
+       tags_all                        = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "Cloud Front"
+           "Project" = "Splitrr"
        }
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = true

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = false
+           default_ttl            = (known after apply)
+           max_ttl                = (known after apply)
+           min_ttl                = 0
+           target_origin_id       = "******************"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts      = 3
+           connection_timeout       = 10
+           domain_name              = "spiltrr-dev-bucket.s3.amazonaws.com"
+           origin_access_control_id = (known after apply)
+           origin_id                = "******************"
#            (1 unchanged attribute hidden)
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn      = "arn:aws:acm:us-east-1:949263681218:certificate/7dfe9968-be1c-4e61-91ca-9b0fb6b97676"
+           minimum_protocol_version = "TLSv1.2_2021"
+           ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.s3_distribution will be created
+   resource "aws_cloudfront_origin_access_control" "s3_distribution" {
+       description                       = "OAC setup for S3_OAC"
+       etag                              = (known after apply)
+       id                                = (known after apply)
+       name                              = "CLOUDFRONT-OAC"
+       origin_access_control_origin_type = "s3"
+       signing_behavior                  = "always"
+       signing_protocol                  = "sigv4"
    }

  # module.cloudfront.aws_s3_bucket_policy.origin will be created
+   resource "aws_s3_bucket_policy" "origin" {
+       bucket = "spiltrr-dev-bucket"
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.cloudfront_acm.aws_acm_certificate_validation.acm_certificate_validation will be created
+   resource "aws_acm_certificate_validation" "acm_certificate_validation" {
+       certificate_arn         = "arn:aws:acm:us-east-1:949263681218:certificate/7dfe9968-be1c-4e61-91ca-9b0fb6b97676"
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.cloudfront_acm.aws_route53_record.route53_record["app.dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "_c4df8a908206e9f4c3665a11330fb7b8.app.dev.bibek65.tech"
+       records         = [
+           "_b279fe69b90a7a78590cf58998c74261.djqtsrsxkq.acm-validations.aws.",
        ]
+       ttl             = 60
+       type            = "CNAME"
+       zone_id         = "*********************"
    }

  # module.cloudfront_acm.aws_route53_record.route53_record["dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech"
+       records         = [
+           "_74072d5ad85d16f715a121df19ecc774.djqtsrsxkq.acm-validations.aws.",
        ]
+       ttl             = 60
+       type            = "CNAME"
+       zone_id         = "*********************"
    }

  # module.cognito.aws_cognito_identity_pool.identity_pool will be created
+   resource "aws_cognito_identity_pool" "identity_pool" {
+       allow_classic_flow               = false
+       allow_unauthenticated_identities = false
+       arn                              = (known after apply)
+       id                               = (known after apply)
+       identity_pool_name               = "splitrr-dev-cognito-identity-pool"
+       tags_all                         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       cognito_identity_providers {
+           client_id               = (known after apply)
+           provider_name           = (known after apply)
+           server_side_token_check = false
        }
    }

  # module.cognito.aws_cognito_user_pool.user_pool will be created
+   resource "aws_cognito_user_pool" "user_pool" {
+       arn                        = (known after apply)
+       auto_verified_attributes   = [
+           "email",
        ]
+       creation_date              = (known after apply)
+       custom_domain              = (known after apply)
+       deletion_protection        = "INACTIVE"
+       domain                     = (known after apply)
+       email_verification_message = (known after apply)
+       email_verification_subject = (known after apply)
+       endpoint                   = (known after apply)
+       estimated_number_of_users  = (known after apply)
+       id                         = (known after apply)
+       last_modified_date         = (known after apply)
+       mfa_configuration          = "OFF"
+       name                       = "splitrr-dev-cognito-user-pool"
+       sms_verification_message   = (known after apply)
+       tags                       = {
+           "Name" = "splitrr-dev-cognito-user-pool"
        }
+       tags_all                   = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-cognito-user-pool"
+           "Project" = "Splitrr"
        }

+       account_recovery_setting {
+           recovery_mechanism {
+               name     = "verified_email"
+               priority = 1
            }
+           recovery_mechanism {
+               name     = "verified_phone_number"
+               priority = 2
            }
        }

+       admin_create_user_config {
+           allow_admin_create_user_only = false
        }

+       password_policy {
+           minimum_length                   = 8
+           require_lowercase                = true
+           require_numbers                  = true
+           require_symbols                  = true
+           require_uppercase                = true
+           temporary_password_validity_days = (known after apply)
        }

+       sms_configuration (known after apply)

+       verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.user_pool_client will be created
+   resource "aws_cognito_user_pool_client" "user_pool_client" {
+       access_token_validity                         = (known after apply)
+       allowed_oauth_flows                           = (known after apply)
+       allowed_oauth_flows_user_pool_client          = (known after apply)
+       allowed_oauth_scopes                          = (known after apply)
+       auth_session_validity                         = (known after apply)
+       callback_urls                                 = (known after apply)
+       client_secret                                 = (sensitive value)
+       default_redirect_uri                          = (known after apply)
+       enable_propagate_additional_user_context_data = (known after apply)
+       enable_token_revocation                       = (known after apply)
+       explicit_auth_flows                           = [
+           "ALLOW_CUSTOM_AUTH",
+           "ALLOW_REFRESH_TOKEN_AUTH",
+           "ALLOW_USER_PASSWORD_AUTH",
+           "ALLOW_USER_SRP_AUTH",
        ]
+       generate_secret                               = false
+       id                                            = (known after apply)
+       id_token_validity                             = (known after apply)
+       logout_urls                                   = (known after apply)
+       name                                          = "splitrr-dev-cognito-user-pool-client"
+       prevent_user_existence_errors                 = (known after apply)
+       read_attributes                               = (known after apply)
+       refresh_token_validity                        = (known after apply)
+       supported_identity_providers                  = (known after apply)
+       user_pool_id                                  = (known after apply)
+       write_attributes                              = (known after apply)
    }

  # module.ecr.aws_ecr_lifecycle_policy.ecr_policy will be created
+   resource "aws_ecr_lifecycle_policy" "ecr_policy" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 14
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "splitrr-dev-ecr-repository"
    }

  # module.ecs-ec2.data.aws_iam_policy_document.ecs_node_doc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_node_doc" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "ec2.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_cpu will be created
+   resource "aws_appautoscaling_policy" "ecs_target_cpu" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-dev-backend-ecs-ec2-cpu-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "***********************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_memory will be created
+   resource "aws_appautoscaling_policy" "ecs_target_memory" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-dev-backend-ecs-ec2-memory-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "***********************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_target.ecs_target will be created
+   resource "aws_appautoscaling_target" "ecs_target" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 1
+       min_capacity       = 1
+       resource_id        = "***********************************************************"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       suspended_state (known after apply)
    }

  # module.ecs-ec2.aws_autoscaling_group.app_asg will be created
+   resource "aws_autoscaling_group" "app_asg" {
+       arn                              = (known after apply)
+       availability_zones               = (known after apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 1
+       force_delete                     = false
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 0
+       health_check_type                = "EC2"
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 2
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = (known after apply)
+       name_prefix                      = (known after apply)
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = [
+           "subnet-0976aa1e5727a1645",
+           "subnet-0d6f60a42ff1b4811",
        ]
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)

+       launch_template {
+           id      = "lt-07553bd93472f3a5d"
+           name    = (known after apply)
+           version = "$Latest"
        }

+       mixed_instances_policy (known after apply)

+       tag {
+           key                 = "Creator"
+           propagate_at_launch = true
+           value               = "bibeklabh@lftechnology.com"
        }
+       tag {
+           key                 = "Name"
+           propagate_at_launch = true
+           value               = "splitrr-dev-backend-ecs-ec2-asg"
        }
+       tag {
+           key                 = "Project"
+           propagate_at_launch = true
+           value               = "Splitrr"
        }

+       traffic_source (known after apply)
    }

  # module.ecs-ec2.aws_cloudwatch_log_group.ecs will be created
+   resource "aws_cloudwatch_log_group" "ecs" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/ecs/splitrr-dev-backend-ecs-ec2"
+       name_prefix       = (known after apply)
+       retention_in_days = 14
+       skip_destroy      = false
+       tags              = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-log-group"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-log-group"
+           "Project" = "Splitrr"
        }
    }

  # module.ecs-ec2.aws_ecs_capacity_provider.main will be created
+   resource "aws_ecs_capacity_provider" "main" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+       tags_all = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       auto_scaling_group_provider {
+           auto_scaling_group_arn         = (known after apply)
+           managed_draining               = (known after apply)
+           managed_termination_protection = "DISABLED"

+           managed_scaling {
+               instance_warmup_period    = (known after apply)
+               maximum_scaling_step_size = 1
+               minimum_scaling_step_size = 1
+               status                    = "ENABLED"
+               target_capacity           = 100
            }
        }
    }

  # module.ecs-ec2.aws_ecs_cluster.main will be created
+   resource "aws_ecs_cluster" "main" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "EC2-ECS-CLUSTER"
+       tags     = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-cluster"
        }
+       tags_all = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-cluster"
+           "Project" = "Splitrr"
        }

+       setting (known after apply)
    }

  # module.ecs-ec2.aws_ecs_cluster_capacity_providers.main will be created
+   resource "aws_ecs_cluster_capacity_providers" "main" {
+       capacity_providers = [
+           "splitrr-dev-backend-ecs-ec2-capacity-provider",
        ]
+       cluster_name       = "EC2-ECS-CLUSTER"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+           weight            = 100
        }
    }

  # module.ecs-ec2.aws_ecs_service.app will be created
+   resource "aws_ecs_service" "app" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = (known after apply)
+       name                               = "splitrr-dev-backend-ecs-ec2-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-service"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-service"
+           "Project" = "Splitrr"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+           weight            = 100
        }

+       load_balancer {
+           container_name   = "splitrr-dev-backend-ecs-ec2-container"
+           container_port   = 3001
+           target_group_arn = (known after apply)
#            (1 unchanged attribute hidden)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = [
+               "subnet-0976aa1e5727a1645",
+               "subnet-0d6f60a42ff1b4811",
            ]
        }

+       ordered_placement_strategy {
+           field = "attribute:ecs.availability-zone"
+           type  = "spread"
        }
    }

  # module.ecs-ec2.aws_ecs_task_definition.app will be created
+   resource "aws_ecs_task_definition" "app" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   environment      = [
+                       {
+                           name  = "NODE_ENV"
+                           value = "prod"
                        },
                    ]
+                   essential        = true
+                   image            = "949263681218.dkr.ecr.us-east-1.amazonaws.com/splitrr-dev-ecr-repository:dev"
+                   logConfiguration = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "/ecs/splitrr-dev-backend-ecs-ec2"
+                           awslogs-region        = "us-east-1"
+                           awslogs-stream-prefix = "app"
                        }
                    }
+                   name             = "splitrr-dev-backend-ecs-ec2-container"
+                   portMappings     = [
+                       {
+                           containerPort = 3001
+                           hostPort      = 3001
                        },
                    ]
+                   secrets          = [
+                       {
+                           name      = "COGNITO_CLIENT_ID"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:COGNITO_CLIENT_ID::"
                        },
+                       {
+                           name      = "COGNITO_REGION"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:COGNITO_REGION::"
                        },
+                       {
+                           name      = "COGNITO_USER_POOL_ID"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:COGNITO_USER_POOL_ID::"
                        },
+                       {
+                           name      = "DATABASE_URL"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:DATABASE_URL::"
                        },
+                       {
+                           name      = "PORT"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:PORT::"
                        },
+                       {
+                           name      = "POSTGRES_DB_NAME"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:POSTGRES_DB_NAME::"
                        },
+                       {
+                           name      = "POSTGRES_PASSWORD"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:POSTGRES_PASSWORD::"
                        },
+                       {
+                           name      = "POSTGRES_USER"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:POSTGRES_USER::"
                        },
                    ]
                },
            ]
        )
+       cpu                      = "1200"
+       execution_role_arn       = (known after apply)
+       family                   = "splitrr-dev-backend-ecs-ec2-task-def"
+       id                       = (known after apply)
+       memory                   = "701"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "EC2",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-task-def"
        }
+       tags_all                 = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-task-def"
+           "Project" = "Splitrr"
        }
+       task_role_arn            = (known after apply)
+       track_latest             = false
    }

  # module.ecs-ec2.aws_iam_policy.ecs_exec_policy will be created
+   resource "aws_iam_policy" "ecs_exec_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Policy for ECS tasks to access Secrets Manager"
+       id               = (known after apply)
+       name             = "splitrr-dev-backend-ecs-ec2-ecs-exec-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
    }

  # module.ecs-ec2.aws_iam_policy.ecs_task_policy will be created
+   resource "aws_iam_policy" "ecs_task_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Policy for ECS tasks to access Cognito"
+       id               = (known after apply)
+       name             = "splitrr-dev-backend-ecs-ec2-ecs-task-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
    }

  # module.ecs-ec2.aws_iam_role.ecs_exec_role will be created
+   resource "aws_iam_role" "ecs_exec_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "splitrr-dev-backend-ecs-ec2-exec-role"
+       path                  = "/"
+       tags_all              = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.ecs-ec2.aws_iam_role.ecs_node_role will be updated in-place
!~  resource "aws_iam_role" "ecs_node_role" {
!~      assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "splitrr-dev-backend-ecs-ec2-node-role20240901163103903800000001"
        name                  = "splitrr-dev-backend-ecs-ec2-node-role20240901163103903800000001"
        tags                  = {}
#        (11 unchanged attributes hidden)
    }

  # module.ecs-ec2.aws_iam_role.ecs_task_role will be created
+   resource "aws_iam_role" "ecs_task_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "splitrr-dev-backend-ecs-ec2-task-role"
+       path                  = "/"
+       tags_all              = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_exec_role_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_exec_role_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = (known after apply)
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_exec_role_policy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "ecs_exec_role_policy_attachment" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_node_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_node_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       role       = "splitrr-dev-backend-ecs-ec2-node-role20240901163103903800000001"
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_node_role_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_node_role_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
+       role       = "splitrr-dev-backend-ecs-ec2-node-role20240901163103903800000001"
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_node_xray_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_node_xray_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess"
+       role       = "splitrr-dev-backend-ecs-ec2-node-role20240901163103903800000001"
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_task_role_policy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "ecs_task_role_policy_attachment" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.ecs-ec2.aws_security_group.ecs_task will be created
+   resource "aws_security_group" "ecs_task" {
+       arn                    = (known after apply)
+       description            = "Allow all traffic within the VPC"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               from_port        = 3001
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = [
+                   "sg-03f989b47ccc8e222",
                ]
+               self             = false
+               to_port          = 3001
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = "splitrr-dev-backend-ecs-ec2-task-sg"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       vpc_id                 = "*********************"
    }

  # module.rds.aws_db_instance.primary will be updated in-place
!~  resource "aws_db_instance" "primary" {
!~      deletion_protection                   = false -> true
        id                                    = "db-YVRBCYG32ISPSN5GMIJAJFPSLU"
        tags                                  = {
            "Name" = "splitrr-dev-rds-db-instance"
        }
#        (70 unchanged attributes hidden)
    }

  # module.target_group.aws_lb_listener_certificate.alb_listener_certificate will be created
+   resource "aws_lb_listener_certificate" "alb_listener_certificate" {
+       certificate_arn = "arn:aws:acm:us-east-1:949263681218:certificate/97ee57cf-6527-4f4b-a9ee-da59f40cadb0"
+       id              = (known after apply)
+       listener_arn    = "arn:aws:elasticloadbalancing:us-east-1:949263681218:listener/app/splitrr-dev-alb/d90f6e3a090c1465/706bca90056828ea"
    }

  # module.target_group.aws_lb_listener_rule.host_based_weighted_routing will be created
+   resource "aws_lb_listener_rule" "host_based_weighted_routing" {
+       arn          = (known after apply)
+       id           = (known after apply)
+       listener_arn = "arn:aws:elasticloadbalancing:us-east-1:949263681218:listener/app/splitrr-dev-alb/d90f6e3a090c1465/706bca90056828ea"
+       priority     = 99
+       tags_all     = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }

+       condition {
+           host_header {
+               values = [
+                   "api.dev.bibek65.tech",
                ]
            }
        }
    }

  # module.target_group.aws_lb_target_group.splitrr_alb_target_group will be created
+   resource "aws_lb_target_group" "splitrr_alb_target_group" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancer_arns                 = (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_anomaly_mitigation  = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "splitrr-dev-lb-lb-tg"
+       name_prefix                        = (known after apply)
+       port                               = 80
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags                               = {
+           "Name" = "splitrr-dev-lb-lb-tg"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-lb-lb-tg"
+           "Project" = "Splitrr"
        }
+       target_type                        = "ip"
+       vpc_id                             = "*********************"

+       health_check {
+           enabled             = true
+           healthy_threshold   = 5
+           interval            = 30
+           matcher             = "200"
+           path                = "/"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = 5
+           unhealthy_threshold = 2
        }

+       stickiness (known after apply)

+       target_failover (known after apply)

+       target_group_health (known after apply)

+       target_health_state (known after apply)
    }

Plan: 39 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #71](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10699041748)